In [10]:
import pandas as pd

#### 1. Use series method to convert the following list [‘a’,’b’,’c’,’d’]

In [11]:
s = pd.Series(['a','b','c','d'],index=[1,2,3,4])
print(s)

1    a
2    b
3    c
4    d
dtype: object

#### 2. Given the lists which contain names of students and their scored marks you have to create data frames which club them all using pandas. 
- student list is [' Name 1' ,' Name 2', ' Name 3' ,' Name 4', ' Name 5' ' Name 6'] 
- Their marks are [[67,89,68,95], [87,94,97,76], [77,85,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]] 
- subjects list  ['DS','AI','MPII', 'CNS']

In [12]:
students = ['Name 1','Name 2','Name 3','Name 4','Name 5','Name 6']
marks = [[67,89,68,95], [87,94,97,76], [77,85,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]]
subjects = ['DS','AI','MPII', 'CNS']

df = pd.DataFrame(data=marks,index=students,columns=subjects)
df

        DS  AI  MPII  CNS
Name 1  67  89    68   95
Name 2  87  94    97   76
Name 3  77  85    99   74
Name 4  90  89    92   78
Name 5  83  97    80   98
Name 6  90  90    80   87

#### 3. Add the TS , total columns to the data frame from which TS is the sum of  DS,AI,MPII and total is the sum of all subjects?

In [13]:
df['TS(DS+AI+MPII)'] = df['DS']+df['AI']+df['MPII']
df['Total'] = df['DS']+df['AI']+df['MPII']+df['CNS']
df

        DS  AI  MPII  CNS  TS(DS+AI+MPII)  Total
Name 1  67  89    68   95             224    319
Name 2  87  94    97   76             278    354
Name 3  77  85    99   74             261    335
Name 4  90  89    92   78             271    349
Name 5  83  97    80   98             260    358
Name 6  90  90    80   87             260    347

#### 4. Display only the marks scored by Name 2 and Name3?

In [14]:
df.loc[['Name 2','Name 3'],:]

        DS  AI  MPII  CNS  TS(DS+AI+MPII)  Total
Name 2  87  94    97   76             278    354
Name 3  77  85    99   74             261    335

#### 5. Display all the students marks who scored 90 + marks in DS?

In [15]:
df[df['DS']>=90]

        DS  AI  MPII  CNS  TS(DS+AI+MPII)  Total
Name 4  90  89    92   78             271    349
Name 6  90  90    80   87             260    347

#### 6. DS teacher wants to know the total marks achieved by students in DS , Help her by using the sum method in data frame

In [16]:
print('Sum of DS Marks :',df['DS'].sum())

Sum of DS Marks : 494

#### B) Include  .csv file in python

In [17]:
data = pd.read_csv("motor.csv")
data.head()

,flow rate(lit/min;/ /,speed,capacity,voltage,current,temprature,capacity in watt,performance
0,40,1400,0.5,120,3.104167,10,372.5,0
1,80,2800,1.0,240,3.104167,20,745.0,0
2,40,1400,0.5,120,3.104167,10,372.5,0
3,160,5600,2.0,480,3.104167,40,1490.0,1
4,40,1400,0.5,120,3.104167,10,372.5,0

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   flow rate(lit/min;/ /  199 non-null    int64
 1   speed                  199 non-null    int64
 2   capacity               199 non-null    float64
 3   voltage                199 non-null    int64
 4   current                199 non-null    float64
 5   temprature             199 non-null    int64
 6   capacity in watt       199 non-null    float64
 7   performance            199 non-null    int64
dtypes: float64(3), int64(5)
memory usage: 12.6 KB